---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.Insert(Autodesk.Revit.DB.PaperSource)
source: html/97312f5f-f12d-0991-e6b5-03d11294f52d.htm
---
# Autodesk.Revit.DB.PaperSourceSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	PaperSource item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSource`)